<script>
    let k = 0;
    function viewInfo(){
        k= k+1;
        if(k==1){
            document.getElementById("bisInfo").style.display="block";
        }
        else{
            k=0;
            document.getElementById("bisInfo").style.display="none";
        }
    }
</script>

<div class="bis">
    <div id="textContainerBis">
        <h1 id="bisHeader">НОЦ <br> "БИС"</h1>
        <p id="bisTextUnderHeader">Объединение<br>и развитие<br>в беспроводных коммуникациях </p>
        <button class="PressMe" on:click={viewInfo}>Подробнее</button>
    </div>
    <img class="photo-bis" src="images/BIS.jpg" alt="Беспроводные инфокоммуникационные сети">
</div>
<div class="bisInfoHolder">
    <p id="bisInfo">
        Научно-образовательный центр "Беспроводные
        инфотелекоммуникационные сети".<br>
        Научно-образовательный центр «Беспроводные инфотелекоммуникационные
        сети» создан с целью объединения и развития компетенций в области
        беспроводных коммуникаций. Центр оснащен передовым измерительным
        оборудованием, позволяющим проводить исследования как на физическом, так
        и на более высоких уровнях. Основной акцент в образовательной деятельности
        центра делается на получение не только теоретических знаний, но и
        практических навыков.<br>
        В связи с расширением лабораторий научно-образовательного центра
        «Беспроводные Инфотелекоммуникационные Сети» проводится набор
        студентов всех факультетов и всех курсов, желающих постигать и работать с
        существующими технологиями связи (например GSM, UMTS, LTE, Wi-Fi,
        Bluetooth), а также принимать участие в проектах по разработке и реализации
        современных технологий связи, в том числе стандартов Интернета Вещей
        (такие как LoRa, NB-IoT, RFID и т.д.).<br>
        Если вам интересны:<br>
        • Работа с живой сетью мобильной связи второго, третьего и четвертого
        поколения, с возможностью проводить различные исследования;<br>
        • Изучение сетевой архитектуры, протоколов передачи данных, IPмаршрутизации;<br>
        • Разведение электронных плат и разработка собственных устройств;<br>
        • Реализация и разработка собственных проектов в направлении IioT;<br>
        • Разработка front-end и back-end приложений;<br>
        • Разработка сайтов.<br>
        Несмотря на техническое направление центра, нам необходимы студенты,
        желающие заниматься следующими гуманитарными направлениями:<br>
        • Маркетинг;<br>
        • Экономика;<br>
        • Написание технической документации и статей.<br>
        Если у вас горят глаза, вы желаете обучится работе с современным
        оборудованием связи, разрабатывать свои устройства, проводить собственные
        научные исследования на живой сети, а также получать уникальные навыки и
        знания, то двери НОЦ «БИС» всегда открыты для вас.<br>
        От нас вы можете ждать:<br>
        • Работу в теплом коллективе и наставления в работе;<br>
        • Прохождение практики в оснащенном по последнему слову техники
        центра;<br>
        • Участие в интересных и актуальных научных исследованиях;<br>
        • Возможность написания вашей дипломной работы на актуальную
        тематику;<br>
        • Возможность реализации вашей идеи;<br>
        • Предоставление возможности общения с представителями крупных
        отраслевых компаний с возможностью стажировок и трудоустройства.<br>
        Факультативы.<br>
        Факультатив «Особенности эксплуатация оборудования сетей мобильной связи
        2, 3, 4G и сетей IMT 2020 на базе оборудования компании Ericsson и Nokia»
        предлагает студентам изучение особенностей разработки топологии сетей
        мобильной связи различных поколений на базе оборудования компании Ericsson
        и Nokia. Особенности работы с транспортной инфраструктурой и базовыми
        станциями. Разработка конфигураторов сети и регламентирующих документов.<br>
        Группа Вконтакте:<a href="https://vk.com/nocbis">https://vk.com/nocbis.</a> <br>
    </p>
</div>
<style>
.bis{
    background-color: white;
    display: -webkit-flex;
    display: -ms-flex;
    display: flex;
    align-items: center;
    max-width: 80%;
    margin-left: 10%;
}
.photo-bis{
    margin-left: auto;
    margin-right: 5px;
    margin-bottom: 5px;
    margin-top: 5px;
    border-radius: 10px;
    height: auto;
    width: 100%;
    max-width: 180px;
}
#bisHeader{
    font-size: 3vw;
    font-family: Gilroy;
    margin-bottom: auto;
    margin-left: 5px;
}
#bisTextUnderHeader{
    font-size: 2.5vw;
    display: block;
    margin-left: 5px;
}
#textContainerBis{
    display: block;
    margin-left: 10px;
}
.PressMe{
    margin-left: 7px;
    max-width: 100%;
    background-color: rgba(255, 169, 39, 0.99);
    color: white;
    border-radius: 5px;
    font-size: 3vw;
    text-shadow: #333333;
}
.bisInfoHolder{
    display: flex;
    max-width: 100%;
}
#bisInfo{
    display: none;
    margin:10px;
    font-size: 3.5vw;
    word-break: break-all;
}
</style>