<script>
    let k = 0;
    function iknaInfo(){
        k= k+1;
        if(k==1){
            document.getElementById("iknaInfo").style.display="block";
        }
        else{
            k=0;
            document.getElementById("iknaInfo").style.display="none";
        }
    }
</script>

<div class="IKNA">
    <div id="textContainerIkna">
        <h1 id="IknaHeader">НОЦ <br> "ИКТ"</h1>
        <p id="IknaTextUnderHeader">Изучение<br>современных технологий<br>в сетях операторов связи </p>
        <button class="PressMe" on:click={iknaInfo}>Подробнее</button>
    </div>
    <img class="photo-Ikna" src="images/IKNA.jpg" alt="Инфокоммуникационные технологии и
нейрокогнитивные архитектуры">
</div>
<div class="iknaInfoHolder">
    <p id="iknaInfo">
        Научно-образовательный центр "Инфокоммуникационных технологий и
        нейрокогнитивных архитектур"<br>
        Для изучения современных технологий, используемых на сетях операторов
        связи, СПб ГУТ им. проф. М.А. Бонч-Бруевича в 2012 году на факультете Сетей
        связи, систем коммутации и вычислительной техники (ныне ИКСС) при
        кафедре Систем коммутации и распределения информации (ныне ИКС)
        организован Научно-образовательный центр IP/MPLS (ныне НОЦ ИКТ),
        который был торжественно запущен 20 июня 2012 года.<br>
        В состав НОЦ ИКТ входят:<br>
        • сетевое оборудование таких крупнейших вендоров, как Huawei, Juniper,
        D-Link и Mikrotik<br>
        • высокопроизводительные сервера IBM.<br>
        • учебный класс на 14 рабочих мест, который включает в себя сервер,
        тонкие клиенты, веб-камеры, гарнитуры и поддерживает УЛК СОТСБИ.<br>
        • мультимедийный интерактивный центр (цифровая доска, проектор,
        микрофон).<br>
        Цели и задачи<br>
        Цели научно-образовательного центра заключаются в обучении бакалавров и
        магистров, проведении летней практики, а также в проведении научноисследовательских работ на полигоне сетевого оборудования.
        Обучение студентов, магистров и бакалавров: три подхода
        • наборы исследовательских работ, разработанных силами НОЦ по
        тематике IP/MPLS/SDN<br>
        • создание инфраструктуры для всех кафедр университета<br>
        • использование инфраструктуры серверов с виртуализацией, и интеграция
        с ЦОД (Центром Обработки Данных СПбГУТ), позволяющая магистрам
        ставить свои эксперименты<br>
        Учебно-лабораторный комплекс<br>
        В учебно-лабораторном комплексе СОТСБИ-У используется комплексный
        подход к системе обучения и поддерживается общая идеология организации
        учебной деятельности – «От теории – К практике». Комплексы позволяют
        изучать теоретический материал, оценивать уровень знаний учащихся и
        проводить подготовительные лабораторные работы в программе. Такой подход
        позволяет обеспечить плавный переход к работам на полигоне с оборудованием
        и сократить разрыв между теорией и практикой.<br>
        В обучающих комплексах реализованы следующие этапы обучения:<br>
        • Интерактивное обучение;<br>
        • Программная оценка знаний;<br>
        • Дистанционный контроль процесса обучения. Модуль преподавателя.<br>
        Работа на полигоне позволяет учащемуся получить навыки работы с
        оборудованием или программным обеспечением, выполняющим его функции,
        моделировать ситуации для выполнения исследовательских работ, которые в
        целом будут востребованы при дальнейшем.<br>
        В НОЦ ИКТ обеспечивается получение базовых знаний о сетевых протоколах и
        новых инфокоммуникационных технологиях, используемых на сетях связи, а
        также получение практических навыков. Полигон НОЦ ИКТ представляет
        собой модель опорной сети оператора связи с уровнями: ядра, агрегации и
        доступа.<br>
        Практика<br>
        На базе НОЦ ИКНС студенты могут пройти производственную практику с
        возможностью дальнейшего трудоустройства в ведущей компании России в
        области Искусственного интеллекта ООО «Естественный Интеллект».
        Программы практики в НОЦ ИКНС многопрофильны, знакомят студентов с
        основными современными направлениями IT, позволяют улучшить
        профессиональные навыки, необходимые для специалиста желающего быть
        востребованным на рынке труда.<br>
        Существует множество различных задач, подбирающихся индивидуально, для
        приобретения и отработки навыков в разных областях:<br>
        1. Нейронные сети<br>
        2. Блокчейн<br>
        3. Web-программирование<br>
        4. Hadoop.<br>
        Факультативы<br>
        1. «Теория и практика Deep Learning в NLP»<br>
        Проектно-ориентированный факультатив посвящен углубленному погружению
        в нейронные сети в области NLP и диалоговых систем. Факультатив рассчитан
        на учащихся, имеющих базовые знания языка программирования Python и
        понимание моделей машинного обучения. В процессе обучения можно будет
        самостоятельно ознакомиться с материалами весенней части факультатива, где
        рассматривали базовые понятия ML и принципы работы в ноутбуках google
        collab. Создадим проекты, решающими конкретные задачи из реальных
        разработок. Для оценки решений используется платформа Kaggle и платформа
        соревнований DSTC.<br>
        2. «Системное администрирование малого офиса»<br>
        Проектно-ориентированный факультатив. В рамках факультатива студенты
        получат знания основ сетевого администрирования и навыки системного
        администратора. Изучат архитектуры слаботочных систем, таких как: система
        IP- телефонии для офиса, система видео-наблюдения и система контроля
        доступа. Подробно рассматриваются вопросы проектирования локальных
        вычислительных сетей, протоколы и технологии стека TCP/IP. Студенты
        получат навыки по обжимке кабеля UTP и проверки его работоспособности при
        помощи специального кабельного тестера. Рассматривается работа
        микросервисов в изолированном окружение (docker). Принципы построения
        контейнеров, основные команды и использования. По итогам факультатива
        студенты подготавливают и защищают свои проекты по проектированию
        слаботочных систем.<br>
        Группа Вконтакте:<a href="https://vk.com/iktns">https://vk.com/iktns</a><br>
    </p>
</div>
<style>
    .IKNA{
        background-color: white;
        display: -webkit-flex;
        display: -ms-flex;
        display: flex;
        align-items: center;
        max-width: 80%;
        margin-left: 10%;
    }
    .photo-Ikna{
        margin-left: auto;
        margin-right: 5px;
        margin-bottom: 5px;
        margin-top: 5px;
        border-radius: 10px;
        height: auto;
        width: 100%;
        max-width: 180px;
    }
    #IknaHeader{
        font-size: 3vw;
        font-family: Gilroy;
        margin-bottom: auto;
        margin-left: 5px;
    }
    #IknaTextUnderHeader{
        font-size: 2.5vw;
        display: block;
        margin-left: 5px;
    }
    #textContainerIkna{
        display: block;
        margin-left: 10px;
    }
    .PressMe{
        margin-left: 7px;
        max-width: 100%;
        background-color: rgba(255, 169, 39, 0.99);
        color: white;
        border-radius: 5px;
        font-size: 3vw;
        text-shadow: #333333;
    }
    .iknaInfoHolder{
        display: flex;
        max-width: 100%;
    }
    #iknaInfo{
        display: none;
        margin:10px;
        font-size: 3.5vw;
        word-break: break-all;
    }
</style>